## **Tugas Besar 2 Pengenalan Komputasi**
### **Kelompok 6**
- Ester Tri Wahyuningsih (16022101)
- Rayyan Hannata Denan   (16022106)
- Valentinus Brian Johan (16022111)
- Brian Matthew          (16022116)

### Import modul-modul yang dibutuhkan dari library

In [127]:
import pandas as pd
from matplotlib import pyplot as plt

### File 'supermarket_sales - Sheet1.csv' dimasukkan ke variabel bernama df menggunakan library pandas

In [128]:
df = pd.read_csv('supermarket_sales - Sheet1.csv')

### Menampilkan dataframe

In [129]:
df

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,233-67-5758,C,Naypyitaw,Normal,Male,Health and beauty,40.35,1,2.0175,42.3675,1/29/2019,13:46,Ewallet,40.35,4.761905,2.0175,6.2
996,303-96-2227,B,Mandalay,Normal,Female,Home and lifestyle,97.38,10,48.6900,1022.4900,3/2/2019,17:16,Ewallet,973.80,4.761905,48.6900,4.4
997,727-02-1313,A,Yangon,Member,Male,Food and beverages,31.84,1,1.5920,33.4320,2/9/2019,13:22,Cash,31.84,4.761905,1.5920,7.7
998,347-56-2442,A,Yangon,Normal,Male,Home and lifestyle,65.82,1,3.2910,69.1110,2/22/2019,15:33,Cash,65.82,4.761905,3.2910,4.1
999,849-09-3807,A,Yangon,Member,Female,Fashion accessories,88.34,7,30.9190,649.2990,2/18/2019,13:28,Cash,618.38,4.761905,30.9190,6.6

## Kolom 1 **'Invoice ID'**
### Invoice ID merupakan *computer-generated number* yang digunakan untuk mengidentifikasi sebuah transaksi

### Khusus untuk data ini, invoice ID tidak memuat suatu pola tertentu (contoh: 3 angka pertama berisi kode cabang dan lokasi, 2 angka ditengah berisi kode barang yang dibeli)
### Berikut sampel data invoice ID dengan **3 angka pertama yang sama**

In [130]:
id = df['Invoice ID'].str.contains('101-', case=False, na = False )
df[id]
# Berikut data Invoice ID yang memuat nomor '803' sebagai 3 angka pertama

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
162,101-17-6199,A,Yangon,Normal,Male,Food and beverages,45.79,7,16.0265,336.5565,3/13/2019,19:44,Credit card,320.53,4.761905,16.0265,7.0
867,101-81-4070,C,Naypyitaw,Member,Female,Health and beauty,62.82,2,6.2820,131.9220,1/17/2019,12:36,Ewallet,125.64,4.761905,6.2820,4.9

### Berikut sampel data invoice ID dengan **2 angka tengah yang sama**

In [131]:
id2 = df['Invoice ID'].str.contains('-01-', case=False, na = False )
df[id2]
# Berikut data Invoice ID yang memuat nomor '803' sebagai 3 angka pertama

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
79,756-01-7507,C,Naypyitaw,Normal,Female,Health and beauty,20.38,5,5.0950,106.9950,1/22/2019,18:56,Cash,101.90,4.761905,5.0950,6.0
99,733-01-9107,B,Mandalay,Normal,Male,Home and lifestyle,82.70,6,24.8100,521.0100,3/5/2019,18:14,Cash,496.20,4.761905,24.8100,7.4
108,588-01-7461,C,Naypyitaw,Normal,Female,Food and beverages,33.98,9,15.2910,321.1110,3/24/2019,10:43,Cash,305.82,4.761905,15.2910,4.2
114,237-01-6122,C,Naypyitaw,Member,Female,Home and lifestyle,80.79,9,36.3555,763.4655,2/1/2019,20:31,Credit card,727.11,4.761905,36.3555,9.5
198,699-01-4164,C,Naypyitaw,Normal,Male,Health and beauty,41.50,4,8.3000,174.3000,3/12/2019,19:58,Credit card,166.00,4.761905,8.3000,8.2
221,468-01-2051,B,Mandalay,Normal,Male,Food and beverages,62.08,7,21.7280,456.2880,3/6/2019,13:46,Ewallet,434.56,4.761905,21.7280,5.4
306,286-01-5402,A,Yangon,Normal,Female,Sports and travel,40.23,7,14.0805,295.6905,3/30/2019,13:22,Cash,281.61,4.761905,14.0805,9.6
376,843-01-4703,B,Mandalay,Member,Female,Home and lifestyle,35.38,9,15.9210,334.3410,1/5/2019,19:50,Credit card,318.42,4.761905,15.9210,9.6
396,316-01-3952,A,Yangon,Normal,Female,Food and beverages,54.27,5,13.5675,284.9175,3/13/2019,14:16,Ewallet,271.35,4.761905,13.5675,4.6
450,891-01-7034,B,Mandalay,Normal,Female,Electronic accessories,74.71,6,22.4130,470.6730,1/1/2019,19:07,Cash,448.26,4.761905,22.4130,6.7
485,438-01-4015,B,Mandalay,Member,Female,Sports and travel,49.49,4,9.8980,207.8580,3/21/2019,15:25,Ewallet,197.96,4.761905,9.8980,6.6
524,534-01-4457,A,Yangon,Normal,Male,Food and beverages,81.71,6,24.5130,514.7730,1/27/2019,14:36,Credit card,490.26,4.761905,24.5130,8.0
693,196-01-2849,C,Naypyitaw,Member,Female,Fashion accessories,73.38,7,25.6830,539.3430,2/10/2019,13:56,Cash,513.66,4.761905,25.6830,9.5
909,624-01-8356,B,Mandalay,Normal,Female,Home and lifestyle,49.01,10,24.5050,514.6050,1/27/2019,10:44,Credit card,490.10,4.761905,24.5050,4.2
993,690-01-6631,B,Mandalay,Normal,Male,Fashion accessories,17.49,10,8.7450,183.6450,2/22/2019,18:35,Ewallet,174.90,4.761905,8.7450,6.6

## Kolom 2 **'Branch'**

### Kolom **'Branch'** berisi data mengenai kode kota tempat transaksi dilakukan

### Terdapat 3 kode kota yaitu **A**, **B**, dan **C** dengan jumlah transaksi di tiap-tiap branch :

In [132]:
pd.DataFrame(df['Branch'].value_counts())
# Jumlah data yang telah disortir berdasarkan 'Branch'

   Branch
A     340
B     332
C     328

## Kolom 3 **'City'**

### Kolom **'City'** berisi data mengenai kota tempat transaksi dilakukan

### Terdapat 3 kode kota yaitu **Yangon**, **Mandalay**, dan **Naypyitaw** dengan jumlah transaksi di tiap-tiap kota :

In [133]:
pd.DataFrame(df['City'].value_counts())
# Jumlah data yang telah disortir berdasarkan 'Branch'

           City
Yangon      340
Mandalay    332
Naypyitaw   328

## Kolom 4 **'Customer type'**

### Kolom **'Customer Type'** berisi data jenis membership pelanggan

### Terdapat 2 *customer type* yaitu *member* dan *normal* dengan jumlah masing-masing :

In [134]:
pd.DataFrame(df['Customer type'].value_counts())

        Customer type
Member            501
Normal            499

## Kolom 4 **'Gender'**

### Kolom **'Gender'** berisi data jenis kelamin pelanggan

### Terdapat 2 jenis kelamin yaitu *male* dan *female* dengan jumlah masing-masing :

In [135]:
pd.DataFrame(df['Gender'].value_counts())

        Gender
Female     501
Male       499

## Kolom 4 **'Product line'**

### Kolom **'Product line'** berisi data jenis barang yang dibeli pelanggan

### Terdapat 6 *product line* dengan jumlah masing-masing :

In [136]:
pd.DataFrame(df['Product line'].value_counts())

                        Product line
Fashion accessories              178
Food and beverages               174
Electronic accessories           170
Sports and travel                166
Home and lifestyle               160
Health and beauty                152

## Kolom 4 **'Unit price'**

### Kolom **'Unit price'** berisi data harga barang yang dibeli

### Berikut 5 transaksi dengan *Unit price* tertinggi

In [137]:
df.nlargest(5,columns = 'Unit price', keep='all').loc[:,['Invoice ID', 'Unit price']]

      Invoice ID  Unit price
122  219-22-9386       99.96
983  148-41-7930       99.96
930  641-62-7288       99.92
494  437-53-3084       99.89
283  667-92-0055       99.83

### Berikut 5 transaksi dengan *Unit price* terendah

In [138]:
df.nsmallest(5,columns = 'Unit price', keep='all').loc[:,['Invoice ID', 'Unit price']]

      Invoice ID  Unit price
944  333-23-2632       10.08
572  239-48-4278       10.13
784  516-77-6464       10.16
822  784-21-9238       10.17
881  115-38-7388       10.18